In [98]:
import pandas as pd
import numpy as np

###1D data -series, 2d data-dataframe structure

In [99]:
list1=["A","B","C","D","E"]
series1=pd.Series(list1,index=['a ','b','c','d','e'])
print(series1)

a     A
b     B
c     C
d     D
e     E
dtype: object

In [100]:
array=np.random.randint(20,25,10)
size=(10)

In [101]:
array

array([24, 24, 24, 21, 20, 22, 23, 20, 24, 20], dtype=int32)

In [102]:
series2=pd.Series(array)
series2

0    24
1    24
2    24
3    21
4    20
5    22
6    23
7    20
8    24
9    20
dtype: int32

In [103]:
series3=pd.Series(np.random.randint(30,35,size=(10) ))

In [104]:
series3

0    33
1    34
2    32
3    30
4    31
5    33
6    34
7    30
8    30
9    34
dtype: int32

In [105]:
print(series2+ series3)

0    57
1    58
2    56
3    51
4    51
5    55
6    57
7    50
8    54
9    54
dtype: int32

Dataframe

In [106]:
student=["Student1","Student2","Student3","Student4","Student5"]
Rollno=['001','002','003','004','005']
scores=[45,56,54,67,87]

record={
    "Students":student,
    "Roll No":Rollno,
    "Scores":scores,
}

In [107]:
record

{'Students': ['Student1', 'Student2', 'Student3', 'Student4', 'Student5'],
 'Roll No': ['001', '002', '003', '004', '005'],
 'Scores': [45, 56, 54, 67, 87]}

In [108]:
record_df=pd.DataFrame(record)
record_df.set_index('Roll No',inplace=True)

record_df

         Students  Scores
Roll No
001      Student1      45
002      Student2      56
003      Student3      54
004      Student4      67
005      Student5      87

In [109]:
dict1={
    "A":[12,13,45,56,78],
    "B":[13,16,18,14,19],
    "C":[45,34,23,15,17],
    "D":[45,34,23,23,32],
}
dict1

{'A': [12, 13, 45, 56, 78],
 'B': [13, 16, 18, 14, 19],
 'C': [45, 34, 23, 15, 17],
 'D': [45, 34, 23, 23, 32]}

In [110]:
df1=pd.DataFrame(dict1)
df1
# df1["A","B"]

    A   B   C   D
0  12  13  45  45
1  13  16  34  34
2  45  18  23  23
3  56  14  15  23
4  78  19  17  32

In [111]:
##to see the columns in the df1
df1.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [112]:
df1

    A   B   C   D
0  12  13  45  45
1  13  16  34  34
2  45  18  23  23
3  56  14  15  23
4  78  19  17  32

In [113]:
df1["E"]=df1["A"]+df1["B"]+df1["C"]+df1["D"]

In [114]:
df1

    A   B   C   D    E
0  12  13  45  45  115
1  13  16  34  34   97
2  45  18  23  23  109
3  56  14  15  23  108
4  78  19  17  32  146

In [115]:
df1["F"]=df1["E"]/4

In [116]:
df1

    A   B   C   D    E      F
0  12  13  45  45  115  28.75
1  13  16  34  34   97  24.25
2  45  18  23  23  109  27.25
3  56  14  15  23  108  27.00
4  78  19  17  32  146  36.50

In [117]:
###Info() method

In [118]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
 3   D       5 non-null      int64
 4   E       5 non-null      int64
 5   F       5 non-null      float64
dtypes: float64(1), int64(5)
memory usage: 372.0 bytes

In [119]:
dict2={
    "Students":["Student1","Student2","Student3","Student4","Student5","Student1","Student7"],
    "Rollno":['001','002',np.nan,'004','005','001','007'],
    "Gender":["M","F",np.nan,"F","M","M","M"],
    "Marks":[10,20,30,np.nan,50,10,60]

}

In [120]:
df2=pd.DataFrame(dict2)

In [121]:
df2

   Students Rollno Gender  Marks
0  Student1    001      M   10.0
1  Student2    002      F   20.0
2  Student3    NaN    NaN   30.0
3  Student4    004      F    NaN
4  Student5    005      M   50.0
5  Student1    001      M   10.0
6  Student7    007      M   60.0

In [122]:
###TO CHECK THE NULL VALUE

In [123]:
df2.isnull().sum()

Students    0
Rollno      1
Gender      1
Marks       1
dtype: int64

In [124]:
df2.duplicated().sum()

np.int64(1)

In [125]:
###REMOVE THE DUPLICATE VALUE
df2.drop_duplicates()

   Students Rollno Gender  Marks
0  Student1    001      M   10.0
1  Student2    002      F   20.0
2  Student3    NaN    NaN   30.0
3  Student4    004      F    NaN
4  Student5    005      M   50.0
6  Student7    007      M   60.0

In [126]:
df2.dropna()

   Students Rollno Gender  Marks
0  Student1    001      M   10.0
1  Student2    002      F   20.0
4  Student5    005      M   50.0
5  Student1    001      M   10.0
6  Student7    007      M   60.0

In [129]:
###MEan and mode imputation

df2

   Students Rollno Gender  Marks
0  Student1    001      M   10.0
1  Student2    002      F   20.0
2  Student3    NaN    NaN   30.0
3  Student4    004      F    NaN
4  Student5    005      M   50.0
5  Student1    001      M   10.0
6  Student7    007      M   60.0

In [134]:
gendermode=df2['Gender'].mode()[0]

In [135]:
gendermode

'M'

In [137]:
marksmean=df2['Marks'].mean()

In [138]:
marksmean

np.float64(30.0)

In [143]:
df2['Gender']=df2['Gender'].fillna(gendermode)
df2['Marks']=df2['Marks'].fillna(marksmean)

In [144]:
df2

   Students Rollno Gender  Marks
0  Student1    001      M   10.0
1  Student2    002      F   20.0
2  Student3    NaN      M   30.0
3  Student4    004      F   30.0
4  Student5    005      M   50.0
5  Student1    001      M   10.0
6  Student7    007      M   60.0

In [145]:
df2=df2.dropna()

In [146]:
df2

   Students Rollno Gender  Marks
0  Student1    001      M   10.0
1  Student2    002      F   20.0
3  Student4    004      F   30.0
4  Student5    005      M   50.0
5  Student1    001      M   10.0
6  Student7    007      M   60.0